schmmd/soleCAN/esp32-s3/src/main.cpp
#if defined(ENABLE_KELLY)
// Decoded Kelly monitor block. Field offsets and raw semantics mirror
// kelly/solectrac-kelly-monitor.py Monitor.decode (offsets 0..21 defined; the
// rest of the 48-byte block is unknown). Values are kept raw, no scaling, to
// match the Python decode — see kelly/README.md for what's CONFIRMED vs
// TENTATIVE. `valid`/`last_seen_ms` drive JSON freshness like the CAN states.
struct KellyState {
    // All 19 fields the app's "AC Monitor" screen shows, in monitor-block
    // offset order. Only a subset is surfaced over BLE (see buildJson) but
    // every field is decoded and available in the full WiFi /json and the
    // dashboard's Kelly detail view.
    uint8_t  tps_pedal         = 0;   // off 0  — throttle AD (0..255; ~253 = hydraulic on)
    uint8_t  brake_pedal       = 0;   // off 1  — brake AD (0..255)
    uint8_t  brake_switch      = 0;   // off 2
    uint8_t  foot_switch       = 0;   // off 3
    uint8_t  forward_switch    = 0;   // off 4
    uint8_t  reverse_switch    = 0;   // off 5  — app labels this "Reversed"
    uint8_t  hall_a            = 0;   // off 6
    uint8_t  hall_b            = 0;   // off 7
    uint8_t  hall_c            = 0;   // off 8
    uint8_t  b_plus_v          = 0;   // off 9  — battery volts (raw byte)
    int16_t  motor_temp_c      = 0;   // off 10
    int16_t  controller_temp_c = 0;   // off 11
    uint8_t  set_direction     = 0;   // off 12 — 0 = forward
    uint8_t  actual_direction  = 0;   // off 13 — 0 = forward
    uint8_t  brake_switch2     = 0;   // off 14
    uint8_t  low_speed         = 0;   // off 15 — 1 = low setpoint (~2400), 0 = high (~2800)
    uint16_t error_status      = 0;   // off 16 — 16-bit fault bitmask (bit -> KELLY_ERROR_NAMES)
    uint16_t motor_speed_rpm   = 0;   // off 18
    uint16_t phase_current_a   = 0;   // off 20
    bool     valid             = false;
    uint32_t last_seen_ms      = 0;
};
#endif

// ── Global state ──────────────────────────────────────────────────────────────
// All updated from the CAN decode path inside loop(), read when building JSON
// from the same thread — no locking needed.

float       g_cell_v[NUM_CELLS];
float       g_temp_c[NUM_TEMPS];
PackState   g_pack;
BmsStateFlags g_bms_state;
BmsLimits   g_bms_limit;
BmsFaults   g_bms_faults;
MotorState  g_motor;
ChargerState g_charger;
ChgrCmdState g_chgr_cmd;
#if defined(ENABLE_KELLY)
KellyState  g_kelly;   // updated by kellyPoll() in loop(), read when building JSON
// Debug counters, always exposed in /json under "kelly_dbg" so we can see the
// serial path even when no valid frame decodes: how many polls fired, how many
// bytes came back, and the raw hex of the last chunk received.
uint32_t    g_kelly_polls    = 0;   // query cycles started
uint32_t    g_kelly_rx_total = 0;   // total bytes ever read from the Kelly UART
uint8_t     g_kelly_last_rx[32];    // last raw chunk received
uint8_t     g_kelly_last_rx_len = 0;
// Flicker/reliability counters: how cleanly frames land.
uint32_t    g_kelly_frames_ok   = 0;      // replies that checksummed
uint32_t    g_kelly_frames_bad  = 0;      // bytes arrived but no frame checksummed
uint32_t    g_kelly_timeouts    = 0;      // no bytes at all (controller unpowered/absent)
uint32_t    g_kelly_blocks_ok   = 0;      // full 48-byte blocks decoded (a card update)
uint32_t    g_kelly_last_block_ms    = 0; // millis() of last full decode
uint32_t    g_kelly_last_frame_ms    = 0; // millis() of last good 16-byte reply (yellow LED heartbeat)
uint32_t    g_kelly_block_gap_max_ms = 0; // worst gap between full decodes (worst flicker)
#endif
uint8_t     g_vc_state   = 0xFF;   // 0xFF = never seen
uint8_t     g_dash_alive = 0xFF;
Dm1State    g_dm1;

// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
uint32_t    g_last_http_ms   = 0;   // millis() at last served HTTP request (defers quiet sleep)
uint32_t    g_can_recoveries = 0;   // bus-off recoveries initiated since boot
uint32_t    g_socketcand_tx_dropped = 0;   // frames dropped on full client TCP buffers
uint32_t    g_slcan_tx_dropped = 0;   // frames dropped on a full USB-CDC TX buffer (stalled reader)
bool        g_can_initialized = false;
bool        g_ap_running      = false;

// STA join telemetry for /config. Written by the WiFi event callback, which
// runs on the system event task rather than the loop task — hence volatile
// single-word values (torn reads aren't possible at word width or below).
volatile uint32_t g_sta_disconnects = 0;
volatile uint8_t  g_sta_last_disconnect_reason = 0;   // 0 = never disconnected

// Runtime STA credentials — the single source of truth for the station join.
// Seeded from NVS if provisioned, else from the compiled WIFI_SSID/WIFI_PASS
// defaults. Written by the /wifi POST handler.
char g_sta_ssid[33] = "";
char g_sta_pass[64] = "";
static Preferences g_prefs;

static inline bool staConfigured() { return g_sta_ssid[0] != '\0'; }

// ── USB port role ─────────────────────────────────────────────────────────────
// The native USB-CDC port has a runtime-selectable role. Boots to LOGGING (enum
// 0); RAM-only, so a power cycle always returns to logging. Switched via PUT /usb
// (and the /usb control page) or a `mode` command typed over the USB console.
//   logging — USB streams device debug/status lines (usbLoggingPoll)
//   slcan   — USB is the SLCAN CAN channel (slcanPoll)
//   kelly   — transparent USB<->Kelly bridge (ENABLE_KELLY only); suspends the
//             regular Kelly monitor polling while active
enum UsbMode { USB_LOGGING = 0, USB_SLCAN, USB_KELLY };
static UsbMode g_usb_mode = USB_LOGGING;

static const char* usbModeName(UsbMode m) {
    switch (m) {
        case USB_SLCAN:   return "slcan";
        case USB_KELLY:   return "kelly";
        case USB_LOGGING: default: return "logging";
    }
}

// Parse a mode name into `out`. Rejects "kelly" unless this is an ENABLE_KELLY
// build, so non-Kelly boards can never select the bridge.
static bool usbModeFromName(const String& s, UsbMode& out) {
    if (s == "logging") { out = USB_LOGGING; return true; }
    if (s == "slcan")   { out = USB_SLCAN;   return true; }
#if defined(ENABLE_KELLY)
    if (s == "kelly")   { out = USB_KELLY;   return true; }
#endif
    return false;
}

// Defined near the SLCAN section (they print over Serial / read device state).
static bool tryModeCommand(const char* line);
void usbLoggingPoll();

