schmmd/soleCAN/esp32-s3/src/main.cpp
// NVS 'wifi' namespace overrides the compiled defaults; an absent 'ssid' key
// means "never provisioned", so fall back to the baked-in defaults (keeps the
// default build's behavior). Call once, before WiFi bring-up.
static void loadStaCreds() {
    g_prefs.begin("wifi", /*readOnly=*/true);
    if (g_prefs.isKey("ssid")) {
        g_prefs.getString("ssid", g_sta_ssid, sizeof(g_sta_ssid));
        g_prefs.getString("pass", g_sta_pass, sizeof(g_sta_pass));
    } else {
        strlcpy(g_sta_ssid, WIFI_SSID, sizeof(g_sta_ssid));
        strlcpy(g_sta_pass, WIFI_PASS, sizeof(g_sta_pass));
    }
    g_prefs.end();
}

static void saveStaCreds(const char* ssid, const char* pass) {
    g_prefs.begin("wifi", /*readOnly=*/false);
    g_prefs.putString("ssid", ssid);
    g_prefs.putString("pass", pass);
    g_prefs.end();
}

// Length-independent compare so a wrong AP password can't be timing-probed.
static bool secretEquals(const String& got, const char* want) {
    size_t wl = strlen(want);
    uint8_t diff = (got.length() != wl) ? 1 : 0;
    for (size_t i = 0; i < got.length(); i++)
        diff |= (uint8_t)got[i] ^ (uint8_t)(i < wl ? want[i] : 0);
    return diff == 0;
}

// Minimal HTML-escape for reflecting the current SSID into the form.
static String htmlEscape(const char* s) {
    String out;
    for (const char* p = s; *p; p++) {
        switch (*p) {
            case '&': out += "&amp;";  break;
            case '<': out += "&lt;";   break;
            case '>': out += "&gt;";   break;
            case '"': out += "&quot;"; break;
            default:  out += *p;       break;
        }
    }
    return out;
}

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

#if defined(AUTOSHUTDOWN)
esp_sleep_wakeup_cause_t g_wake_cause = ESP_SLEEP_WAKEUP_UNDEFINED;   // set once in setup()
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── SD-card session logging (RejsaCAN) ──────────────────────────────────────────
// Records two streams to the onboard microSD whenever a card is present at boot:
//
//   /sNNNNN/can_PP.asc    every received CAN frame, Vector ASCII — replayable by
//                         solecan-analyze.py / solecan-stream.py --replay unchanged
//   /sNNNNN/data_PP.jsonl one buildJson() snapshot per line at SD_JSON_HZ (default 1)
//
// Design (see also the plan): loop() (core 1) only *formats* bytes and pushes them
// into two PSRAM ring buffers; a dedicated writer task (core 0) does every SD I/O.
// This keeps the decoded-state globals single-threaded — buildJson() and the .asc
// formatter both run on the loop task, and only opaque bytes cross to the writer —
// and it keeps SD stalls (block erase) off the CAN drain: a full ring drops whole
// lines (counted) rather than blocking loop(). Mid-session SD failures are
// handled by remount-and-resume (see sdRecoverOrFail); only repeated back-to-back
// failures latch "error" until reboot. No hot-insert: the card is probed once at
// boot; if it isn't there, the whole feature stays dormant (reboot to use a card
// inserted later).
#if defined(HAS_SD)

// ── Tunables ──
#ifndef SD_JSON_HZ
#define SD_JSON_HZ          1                         // decoded-snapshot cadence
#endif
#define SD_MAX_PART_BYTES   (64ULL * 1024 * 1024)     // roll raw/json parts at this size
#define SD_MIN_FREE_BYTES   (512ULL * 1024 * 1024)    // reap oldest sessions below this
#define SD_FLUSH_MS         1000                      // fsync cadence → ≤~1 s lost on power cut
#define SD_RAW_RING_BYTES   (1024UL * 1024)           // PSRAM ring for raw .asc
#define SD_JSON_RING_BYTES  (256UL * 1024)            // PSRAM ring for json lines
#define SD_FREE_CHECK_MS    10000                     // usedBytes() is slow — poll sparingly
#define SD_RECOVER_ATTEMPTS 5                         // remount tries before latching error
#define SD_RECOVER_DELAY_MS 250                       // backoff base between remount tries
#define SD_WRITE_CHUNK_BYTES 8192                     // batch writes into bursts this size

struct SdState {
    const char* state = "no_card";     // no_card | logging | error
    uint32_t          session   = 0;
    volatile uint32_t kb_written = 0;  // writer task (core 0) owns these two
    volatile uint32_t free_mb    = 0;
    const char*       fail_op  = "";     // which SD call failed (state == "error")
    volatile uint32_t fail_kb  = 0;      // KB written when it failed
    volatile uint32_t recoveries = 0;    // successful remount-and-resume cycles
};
static SdState g_sd;

// Set true once at boot after a successful mount + first session open; gates the
// producer in loop(). Only ever cleared again (mid-session card failure), never
// re-armed until reboot. Cross-core rule for this flag and the status fields in
// SdState/SdStream: every field has exactly one writer, and readers (buildJson)
// tolerate a torn multi-field snapshot — no control flow crosses the core
// boundary except this flag; the writer task otherwise sees nothing but bytes
// in the ring buffers.
volatile bool g_sd_active = false;

// Serializes every SD/SPI touch between the writer task (core 0) and the
// /sd/* HTTP handlers (loop task, core 1). The writer holds it per
// drain/flush/roll burst; HTTP holds it per operation — and per read chunk
// while streaming a tar — so a download stalls logging only briefly and the
// PSRAM rings absorb it. sdFail() must release it before self-deleting.
static SemaphoreHandle_t g_sd_mutex = nullptr;

// Session id currently being streamed as a tar by handleSdSessionGet (0 = none;
// session numbering starts at 1). The free-space reaper (sdScanSessions)
// excludes it so it can never SD.remove() a file of a session an HTTP client has
// open mid-download — illegal under FatFs FS_LOCK=0 and a volume-corruption
// risk. Set/cleared only on the loop task; volatile because the writer task
// reads it under the mutex.
static volatile uint32_t g_sd_http_stream_session = 0;

struct SdLock {
    SdLock()  { xSemaphoreTake(g_sd_mutex, portMAX_DELAY); }
    ~SdLock() { xSemaphoreGive(g_sd_mutex); }
};

