schmmd/soleCAN/esp32-s3/src/main.cpp
// RAII guard for g_sd_http_stream_session so every early return from the tar
// handler clears the reaper exclusion.
struct SdStreamGuard {
    explicit SdStreamGuard(uint32_t id) { g_sd_http_stream_session = id; }
    ~SdStreamGuard() { g_sd_http_stream_session = 0; }
};

// One logged stream: a PSRAM ring fed by loop() (core 1) and drained to the
// current part file by the writer task (core 0). The raw .asc and the json
// .jsonl are two instances; everything that touches a stream goes through the
// shared helpers below so the two lifecycles can't drift apart.
struct SdStream {
    const char*          path_fmt;    // "/s%05lu/<name>_%02u.<ext>" (session, part)
    const char*          write_op;    // fail_op tag for a failed write
    const char*          open_op;     // fail_op tag for a failed part open
    bool                 asc_header;  // new parts get the Vector ASCII header
    size_t               ring_bytes;
    StreamBufferHandle_t sb = nullptr;
    StaticStreamBuffer_t sb_struct;
    uint8_t*             storage = nullptr;
    File                 file;            // writer task (core 0) owns these two
    uint64_t             part_bytes = 0;
    volatile uint16_t    part = 0;
    volatile uint32_t    dropped = 0;     // producer (core 1) owns this
};
static SdStream g_sd_raw  = { "/s%05lu/can_%02u.asc",    "raw_write",  "raw_open",  true,  SD_RAW_RING_BYTES };
static SdStream g_sd_json = { "/s%05lu/data_%02u.jsonl", "json_write", "json_open", false, SD_JSON_RING_BYTES };

static int64_t g_sd_session_start_us = 0;   // esp_timer µs at session open (log t=0)

// ── Producer side (runs on the loop task, core 1) ──

// Format one frame as a Vector ASCII data line and push it to the raw ring.
// Line-atomic: if the whole line doesn't fit, drop it and count it rather than
// write a fragment or block the CAN drain.
static inline void sdEnqueueRaw(const twai_message_t& msg) {
    char line[96];
    double ts = (esp_timer_get_time() - g_sd_session_start_us) / 1e6;
    int n = snprintf(line, sizeof line, " %.6f 1  %0*lX%s   Rx   d %u",
                     ts, msg.extd ? 8 : 3, (unsigned long)msg.identifier,
                     msg.extd ? "x" : "", (unsigned)msg.data_length_code);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof line - 4; i++)
        n += snprintf(line + n, sizeof line - n, " %02X", msg.data[i]);
    if (n < (int)sizeof line - 1) line[n++] = '\n';
    if (xStreamBufferSpacesAvailable(g_sd_raw.sb) >= (size_t)n)
        xStreamBufferSend(g_sd_raw.sb, line, n, 0);
    else
        g_sd_raw.dropped = g_sd_raw.dropped + 1;
}

// Push one JSON snapshot (built by the caller) as a line to the json ring. Only a
// single producer touches the ring, so the space check can't race with a shrink
// (the consumer only frees space), making the two sends effectively atomic.
static inline void sdEnqueueJson(const String& js) {
    size_t len = js.length();
    if (xStreamBufferSpacesAvailable(g_sd_json.sb) >= len + 1) {
        xStreamBufferSend(g_sd_json.sb, js.c_str(), len, 0);
        xStreamBufferSend(g_sd_json.sb, "\n", 1, 0);
    } else {
        g_sd_json.dropped = g_sd_json.dropped + 1;
    }
}

// ── Writer side (runs on the dedicated task, core 0) ──

// Vector ASCII header. The ESP32 has no RTC/NTP, so the wall-clock date is
// nominal; what matters to the readers is "base hex" + "timestamps absolute"
// and monotonic per-line timestamps (which are session-relative seconds).
static void sdWriteAscHeader(File& f) {
    f.print("date Thu Jan 1 00:00:00.000 1970\n");
    f.print("base hex  timestamps absolute\n");
    f.print("internal events logged\n");
    f.print("   0.000000 Start of measurement\n");
}

// Basename of a directory entry — e.name() may or may not carry a leading path
// depending on core version.
static const char* sdBasename(const char* name) {
    const char* slash = strrchr(name, '/');
    return slash ? slash + 1 : name;
}

// Parse a session directory basename: exactly 's' followed by digits. Anything
// else — a user's "stuff/" folder, "saved" — is rejected; strtoul alone would
// parse those to 0 and permanently jam the reaper on a nonexistent /s00000.
static bool sdParseSession(const char* nm, uint32_t& n) {
    if (nm[0] != 's' || nm[1] < '0' || nm[1] > '9') return false;
    char* end = nullptr;
    n = strtoul(nm + 1, &end, 10);
    return *end == '\0';
}

// One walk of the root directory serving both consumers: the highest session
// index (next session number = highest + 1, monotonic per card, survives
// reaping and card swaps with no counter file) and the lowest index excluding
// the active session (the reaper's victim). 0 / UINT32_MAX when none exist.
static void sdScanSessions(uint32_t& lowest_other, uint32_t& highest) {
    lowest_other = UINT32_MAX;
    highest = 0;
    File root = SD.open("/");
    if (!root) return;
    for (File e = root.openNextFile(); e; e = root.openNextFile()) {
        uint32_t n;
        if (e.isDirectory() && sdParseSession(sdBasename(e.name()), n)) {
            if (n > highest) highest = n;
            if (n < lowest_other && n != g_sd.session &&
                n != g_sd_http_stream_session) lowest_other = n;
        }
        e.close();
    }
    root.close();
}

// Open the stream's current part file (fresh — FILE_WRITE truncates) and reset
// its size accounting.
static bool sdOpenPart(SdStream& s) {
    char path[32];
    snprintf(path, sizeof path, s.path_fmt, (unsigned long)g_sd.session, s.part);
    s.file = SD.open(path, FILE_WRITE);
    if (!s.file) return false;
    if (s.asc_header) sdWriteAscHeader(s.file);
    s.part_bytes = 0;
    return true;
}

static bool sdStartSession() {
    uint32_t lowest, highest;
    sdScanSessions(lowest, highest);
    g_sd.session   = highest + 1;
    g_sd_raw.part  = 0;
    g_sd_json.part = 0;
    char dir[16];
    snprintf(dir, sizeof dir, "/s%05lu", (unsigned long)g_sd.session);
    if (!SD.mkdir(dir)) return false;
    g_sd_session_start_us = esp_timer_get_time();
    if (!sdOpenPart(g_sd_raw)) return false;
    if (!sdOpenPart(g_sd_json)) { g_sd_raw.file.close(); return false; }
    return true;
}

// Delete a session directory. Sessions hold only flat files (can_PP.asc /
// data_PP.jsonl), so remove them one at a time — re-opening the dir each pass
// avoids invalidating the FatFS iterator by deleting during a walk.
static bool sdRemoveSessionDir(const char* path) {
    for (;;) {
        File d = SD.open(path);
        if (!d) return false;
        File e = d.openNextFile();
        if (!e) { d.close(); break; }
        char child[80];
        snprintf(child, sizeof child, "%s/%s", path, sdBasename(e.name()));
        e.close();
        d.close();
        if (!SD.remove(child)) return false;
    }
    return SD.rmdir(path);
}

// Reap the oldest session dir, never the active one. Returns false when there's
// nothing else to delete.
static bool sdReapOldest() {
    uint32_t oldest, highest;
    sdScanSessions(oldest, highest);
    if (oldest == UINT32_MAX) return false;
    char path[16];
    snprintf(path, sizeof path, "/s%05lu", (unsigned long)oldest);
    return sdRemoveSessionDir(path);
}

// Refresh free-space figure and reap oldest sessions until we're back above the
// threshold (or only the active session remains).
static void sdUpdateFree() {
    uint64_t total = SD.totalBytes();
    uint64_t used  = SD.usedBytes();
    uint64_t freeb = total > used ? total - used : 0;
    while (freeb < SD_MIN_FREE_BYTES) {
        if (!sdReapOldest()) break;
        used  = SD.usedBytes();
        freeb = total > used ? total - used : 0;
    }
    g_sd.free_mb = (uint32_t)(freeb >> 20);
}

// Total bytes written this session, both streams. Writer task (core 0) owns it.
static uint64_t sd_total_bytes = 0;

// Give up logging for the rest of this boot. The CAN tap keeps running. `op` and
// the running byte count are kept for the /json status so a field failure is
// diagnosable. Self-deletes the calling task — only callable from the writer
// task; boot-time failures latch their error in sdInit() instead.
static void sdFail(const char* op) {
    g_sd.fail_op = op;
    g_sd.fail_kb = (uint32_t)(sd_total_bytes >> 10);
    g_sd_active  = false;
    g_sd.state   = "error";
    if (g_sd_raw.file)  g_sd_raw.file.close();
    if (g_sd_json.file) g_sd_json.file.close();
    xSemaphoreGive(g_sd_mutex);   // held by the writer's burst — free it or HTTP deadlocks
    vTaskDelete(nullptr);
}

// An SD call failed mid-session. Observed failure mode on the RejsaCAN: the card
// stops answering CMD13 (SEND_STATUS) under sustained write load — on two
// different cards and both Arduino cores — and a reboot always brings it back.
// So instead of latching "error" on the first bad write, remount and resume the
// same session with fresh part files (bounded attempts, linear backoff). The
// failed chunk is still in the caller's buffer and is re-written after we
// return; the rings keep absorbing frames while we're remounting, so a
// sub-second recovery usually loses nothing.
//
// A stream whose file was open when the failure hit moves to a fresh part — its
// on-card tail ends at the last fsync, possibly mid-line, so appending is
// unsafe. A stream whose file was already closed (a part-roll open that failed)
// retries the same, never-created part number instead of skipping one.
static void sdRecoverOrFail(const char* op) {
    if (g_sd_raw.file)  g_sd_raw.part = g_sd_raw.part + 1;
    if (g_sd_json.file) g_sd_json.part = g_sd_json.part + 1;
    for (int attempt = 1; attempt <= SD_RECOVER_ATTEMPTS; attempt++) {
        g_sd_raw.file.close();
        g_sd_json.file.close();
        SD.end();
        vTaskDelay(pdMS_TO_TICKS(SD_RECOVER_DELAY_MS * attempt));
        if (!SD.begin(SD_CS_PIN)) continue;
        if (!sdOpenPart(g_sd_raw))  continue;
        if (!sdOpenPart(g_sd_json)) continue;
        g_sd.recoveries = g_sd.recoveries + 1;
        return;
    }
    sdFail(op);   // never returns
}

