schmmd/soleCAN/esp32-s3/src/main.cpp
    if (src == SRC_BMS) {

        if (pgn >= PGN_CELL_FIRST && pgn <= PGN_CELL_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_CELL_FIRST) * 4;
            for (int slot = 0; slot < 4; slot++) {
                int idx = base + slot;
                if (idx >= NUM_CELLS) break;
                uint16_t mv = be16(d[2*slot], d[2*slot+1]);
                if (mv && mv != 0xFFFF)
                    g_cell_v[idx] = mv / 1000.0f;
            }

        } else if (pgn >= PGN_TEMP_FIRST && pgn <= PGN_TEMP_LAST) {
            if (allZero(d)) return;
            int base = (pgn - PGN_TEMP_FIRST) * 8;
            for (int slot = 0; slot < 8; slot++) {
                int idx = base + slot;
                if (idx >= NUM_TEMPS) break;
                if (d[slot] && d[slot] != 0xFF)
                    g_temp_c[idx] = (float)(d[slot] - TEMP_OFFSET_C);
            }

        } else if (pgn == PGN_F100) {
            if (allZero(d)) return;
            uint16_t raw_cur = be16(d[2], d[3]);
            // Sign convention: positive = charging, negative = discharging.
            float amps  = -((int32_t)raw_cur - PACK_CURRENT_BIAS_RAW) * PACK_CURRENT_LSB_A;
            // Pack voltage is one BE-16 field at 0.1 V/bit. The 60-84 V
            // operating window keeps d[0] at 0x02/0x03, which can make it
            // masquerade as a range-selector byte plus 8-bit voltage.
            float volts = be16(d[0], d[1]) * PACK_VOLTAGE_LSB_V;
            g_pack.voltage_v   = volts;
            g_pack.current_raw = raw_cur;
            g_pack.current_a   = amps;
            g_pack.power_w     = volts * amps;
            g_pack.soc_raw     = d[4];
            g_pack.soc_pct     = d[4] * 0.4f - 0.8f;
            if (isnan(g_session_soc_start_pct))
                g_session_soc_start_pct = g_pack.soc_pct;

            // Integrate power into session energy counters
            uint32_t now = millis();
            if (g_session_last_ms != 0) {
                uint32_t dt_ms = now - g_session_last_ms;
                float dt_s = dt_ms / 1000.0f;
                if (dt_s > 0 && dt_s < 5.0f) {   // sanity: skip bus-silent gaps
                    g_session_active_ms += dt_ms;
                    // power_w: positive = charging, negative = discharging
                    float wh = g_pack.power_w * dt_s / 3600.0f;
                    if (wh > 0) g_session_wh_charged += wh;
                    else        g_session_wh_drawn   += -wh;
                }
            }
            g_session_last_ms = now;

        } else if (pgn == PGN_F102) {
            if (allZero(d)) return;
            uint16_t max_mv = be16(d[0], d[1]);
            uint16_t min_mv = be16(d[2], d[3]);
            if (!max_mv || !min_mv) return;
            g_pack.cell_max_mv             = max_mv;
            g_pack.cell_min_mv             = min_mv;
            g_pack.cell_spread_mv          = max_mv - min_mv;
            g_pack.cell_max_n              = d[4];
            g_pack.cell_min_n              = d[5];
            g_pack.cell_spread_mv_reported = d[7];
            g_pack.v_estimate = 20.0f * (max_mv + min_mv) / 2.0f / 1000.0f;

        } else if (pgn == PGN_F104) {
            if (allZero(d) || d[0] == 0xFF || d[1] == 0xFF) return;
            g_pack.temp_max_c   = (int8_t)(d[0] - TEMP_OFFSET_C);
            g_pack.temp_min_c   = (int8_t)(d[1] - TEMP_OFFSET_C);
            g_pack.temp_max_n   = d[2];
            g_pack.temp_min_n   = d[3];
            g_pack.temp_spread_c = (int8_t)d[4];

        } else if (pgn == PGN_F106) {
            if (allZero(d)) return;
            g_bms_state.byte0 = d[0];
            g_bms_state.byte1 = d[1];
            g_bms_state.valid = true;

        } else if (pgn == PGN_F107) {
            if (allZero(d)) return;
            g_bms_limit.last_seen_ms = millis();
            g_bms_limit.discharge_a = be16(d[0], d[1]) * LIMIT_CURRENT_LSB_A;
            g_bms_limit.charge_a    = be16(d[2], d[3]) * LIMIT_CURRENT_LSB_A;
            g_bms_limit.charge_power_extra_w = be16(d[6], d[7]) * LIMIT_POWER_EXTRA_LSB_W;
            g_bms_limit.mode  = d[4];
            g_bms_limit.byte5 = d[5];
            g_bms_limit.valid = true;

        } else if (pgn == PGN_F108) {
            // F108 is a continuous bitmap broadcast: an all-zero frame means
            // "no faults" and must clear previously latched codes, so there
            // is deliberately no allZero() skip here.
            memcpy(g_bms_faults.bytes, d, 8);
            g_bms_faults.active_codes_mask = 0;
            for (int bi = 0; bi < 7; bi++) {
                for (int bit = 0; bit < 8; bit++) {
                    uint8_t code = FAULT_BYTES_0_TO_6[bi][bit];
                    if (code && ((d[bi] >> bit) & 1))
                        g_bms_faults.active_codes_mask |= (1ULL << (code - 100));
                }
            }
            for (int bit = 0; bit < 8; bit++) {
                uint8_t code = FAULT_BYTE7[bit];
                if (code && ((d[7] >> bit) & 1))
                    g_bms_faults.active_codes_mask |= (1ULL << (code - 100));
            }
            g_bms_faults.any_fault = g_bms_faults.active_codes_mask != 0;
        }

    } else if (src == SRC_VEHICLE && pgn == PGN_F100) {
        g_vc_state = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FF21) {
        uint16_t rpm_raw  = le16(d[2], d[3]);
        int      rpm_mag  = (int)rpm_raw - RPM_BIAS;
        // Raw can jitter a bit below the zero-RPM bias at standstill; without
        // the clamp the uint16_t cast below would wrap a small negative to
        // ~65000 RPM (and a garbage speed).
        if (rpm_mag < 0) rpm_mag = 0;
        uint8_t  fnr      = d[7] & 0x0F;
        int8_t   dir      = (fnr == 0x4) ? 1 : (fnr == 0x8) ? -1 : 0;
        g_motor.rpm_magnitude      = (uint16_t)rpm_mag;
        g_motor.rpm_signed         = dir * rpm_mag;
        g_motor.direction          = dir;
        g_motor.range         = ((d[7] >> 4) & 0x0F) + 1;
        g_motor.torque_raw       = le16(d[0], d[1]);
        if (d[4]) g_motor.controller_temp_c = (int8_t)(d[4] - TEMP_OFFSET_C);
        if (d[5]) g_motor.motor_temp_c      = (int8_t)(d[5] - TEMP_OFFSET_C);
        g_motor.valid = true;
        g_motor.last_seen_ms = millis();

    } else if (src == SRC_DASH && pgn == PGN_FF21) {
        g_dash_alive = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FECA) {
        uint32_t spn = d[2] | ((uint32_t)d[3] << 8)
                       | (((uint32_t)(d[4] >> 5) & 0x07) << 16);
        uint8_t fmi = d[4] & 0x1F;
        bool active = (spn || fmi);
        if (!d[0] && !d[1] && !active) {
            // Healthy idle — clear any previously latched DTC so the JSON
            // reports "presently inactive", not "last fault ever observed".
            g_dm1 = Dm1State();
            return;
        }
        g_dm1.lamp_byte0 = d[0];
        g_dm1.lamp_byte1 = d[1];
        g_dm1.dtc_spn    = spn;
        g_dm1.dtc_fmi    = fmi;
        g_dm1.dtc_cm     = (d[5] >> 7) & 0x01;
        g_dm1.dtc_oc     = d[5] & 0x7F;
        g_dm1.valid      = true;

    } else if (src == SRC_CHARGER && pgn == PGN_FF50) {
        if (allZero(d)) return;
        // Standard Elcon/TC charger status frame: BE-16 output voltage and
        // BE-16 output current (0.1/bit each), then a fault-flag byte
        // (CHGR_FLAG_*; 0x00 = actively delivering). Voltage reads the
        // charger's own output terminals — it equals pack V only while
        // delivering, so consumers gate any pack-V use on flags == 0.
        g_charger.v_raw     = be16(d[0], d[1]);
        g_charger.i_raw     = be16(d[2], d[3]);
        g_charger.flags     = d[4];
        g_charger.voltage_v = g_charger.v_raw * PACK_VOLTAGE_LSB_V;
        g_charger.current_a = g_charger.i_raw * CHARGER_I_LSB_A;
        g_charger.valid = true;

    } else if (src == SRC_BMS_CHGR_IF && pgn == PGN_PROP_0600) {
        uint16_t v_set = be16(d[0], d[1]);
        uint16_t i_set = be16(d[2], d[3]);
        g_chgr_cmd.enable = d[4];
        if (v_set || i_set) {
            g_chgr_cmd.voltage_v = v_set * 0.1f;
            g_chgr_cmd.current_a = i_set * 0.1f;
            g_chgr_cmd.v_raw     = v_set;
            g_chgr_cmd.i_raw     = i_set;
        } else {
            // Idle frame: V=0, I=0, enable=1 — clear the setpoint so the JSON
            // emits enable only, instead of freezing on the last active values.
            g_chgr_cmd.voltage_v = NAN;
            g_chgr_cmd.current_a = NAN;
            g_chgr_cmd.v_raw     = 0;
            g_chgr_cmd.i_raw     = 0;
        }
        g_chgr_cmd.valid = true;
    }
}

// ── Kelly e-hydraulic pump monitor (opt-in) ─────────────────────────────────────
#if defined(ENABLE_KELLY)
// Read-only serial monitor for the Kelly KLS pump controller on UART1. Ports the
// ETS protocol from kelly/solectrac-kelly-monitor.py: 8N1, three zero-data
// monitor queries 0x3A/0x3B/0x3C, each answered by [CMD,0x10,<16 data>,CHK]; the
// three 16-byte replies concatenate into a 48-byte block. Polling is a
// cooperative state machine so loop() never blocks. See kelly/README.md.

