schmmd/soleCAN/esp32-s3/src/main.cpp
// UART1 is the Kelly port and nothing else, so name it for what is on the far
// end rather than for the peripheral index.
static HardwareSerial &kelly = Serial1;

// The Kelly transmits at its documented 19200 baud — fixed, no sweep; CONFIRMED
// by sustained ~99% frame success. An earlier ~19,900 figure (crystal-referenced
// edge timing) was measured through a doubly-corrupted receive path — an
// Arduino core 2.0.x firmware bug (fixed by the pioarduino/core-3.x platform,
// see platformio.ini) on top of the noisy RXD0 console pad (GPIO44, since
// moved to GPIO47/48) — and is void. The full story is in kelly/README.md
// §"Actual line rate".
static const uint32_t KELLY_BAUD = 19200;
static const uint8_t  KELLY_MON_CMDS[3]      = {0x3A, 0x3B, 0x3C};
static const uint32_t KELLY_POLL_INTERVAL_MS = 40;     // gap between individual queries
static const uint32_t KELLY_CMD_TIMEOUT_MS   = 600;    // per-command reply wait
                                                       // (matches the Python
                                                       // monitor's 0.6 s; the
                                                       // Kelly's turnaround plus
                                                       // loop latency exceeds a
                                                       // short window)
static const uint32_t KELLY_STALE_MS         = 5000;   // JSON freshness window (a
                                                       // little headroom over the
                                                       // observed worst-case gap)
static const uint32_t KELLY_FLASH_TIMEOUT_MS = 250;    // per flash-read exchange
                                                       // (a live link answers in
                                                       // ms; short so the whole
                                                       // burst is bounded)

// Display-only fault names by error_status bit (0..15). Kept in the renderer per
// project convention; the encoding (BE u16 @ block offset 16) is the protocol
// fact. Mirrors ERROR_NAMES in solectrac-kelly-monitor.py.
static const char* const KELLY_ERROR_NAMES[16] = {
    "Identify Err", "Over Volt", "Low Volt", "Reserved",
    "Locking", "V+ Err", "Overtemp", "High Pedel",
    "Reserved", "Reset Error", "Pedel Error", "Hall Sensor Error",
    "Reserved", "Emergency Rev Err", "Motor OverTemp Err", "Current Meter Err",
};

// Read-only by construction. Only two command sets ever reach the wire:
//   * kellySendQuery below — the three zero-data monitor queries (0x3A/3B/3C).
//   * kellyReadFlash below — a flash-session OPEN (0xF1) and block READs (0xF2),
//     for the on-demand /kelly/config dump.
// The write/burn/erase commands (0xF3/0xF4/0xB1..0xB4) are never emitted, so the
// firmware can read configuration but cannot alter it — mirroring the allowlists
// in the Python monitor and dump-config tools. Opening a flash session is benign:
// the official app does it on every connect to detect the model, and it clears
// when the controller powers off (no close is sent — 0xF4 doubles as the burn).
static bool kellyIsMonitorCmd(uint8_t cmd) {
    return cmd == 0x3A || cmd == 0x3B || cmd == 0x3C;
}
static void kellySendQuery(uint8_t cmd) {
    if (!kellyIsMonitorCmd(cmd)) return;          // refuse anything else
    const uint8_t frame[3] = {cmd, 0x00, cmd};    // [CMD, LEN=0, CHK=CMD]
    kelly.write(frame, sizeof(frame));
}

// Decode the 48-byte block into g_kelly. Offsets and raw (unscaled) semantics
// mirror Monitor.decode; only offsets 0..21 are defined by the protocol.
static void kellyDecodeBlock(const uint8_t* b) {
    g_kelly.tps_pedal         = b[0];
    g_kelly.brake_pedal       = b[1];
    g_kelly.brake_switch      = b[2];
    g_kelly.foot_switch       = b[3];
    g_kelly.forward_switch    = b[4];
    g_kelly.reverse_switch    = b[5];
    g_kelly.hall_a            = b[6];
    g_kelly.hall_b            = b[7];
    g_kelly.hall_c            = b[8];
    g_kelly.b_plus_v          = b[9];
    g_kelly.motor_temp_c      = b[10];   // raw byte, as the Python decode leaves it
    g_kelly.controller_temp_c = b[11];
    g_kelly.set_direction     = b[12];
    g_kelly.actual_direction  = b[13];
    g_kelly.brake_switch2     = b[14];
    g_kelly.low_speed         = b[15];
    g_kelly.error_status      = (uint16_t(b[16]) << 8) | b[17];   // big-endian
    g_kelly.motor_speed_rpm   = (uint16_t(b[18]) << 8) | b[19];
    g_kelly.phase_current_a   = (uint16_t(b[20]) << 8) | b[21];
    g_kelly.valid             = true;
    g_kelly.last_seen_ms      = millis();
}


void kellyInit() {
    // kelly.begin(baud, config, rxPin, txPin). The Kelly runs at a fixed 19200.
    kelly.begin(KELLY_BAUD, SERIAL_8N1, KELLY_RXD_PIN, KELLY_TXD_PIN);
}

// Fault-tolerant poller. Rotates through the monitor commands one at a time,
// caching each good reply in its own 16-byte slot with a timestamp. The decoded
// reading is rebuilt whenever every needed slot is recently fresh — so a single
// corrupted reply (EMI, a marginally-off baud) only delays that one slot instead
// of dropping the whole reading and flickering the card. Only 0x3A and 0x3B are
// polled: their 32 bytes carry every field kellyDecodeBlock reads (offsets
// 0..21); 0x3C's bytes are unused, so skipping it halves the frames per reading.
static const uint8_t KELLY_N_POLL = 2;   // poll KELLY_MON_CMDS[0..1] = 0x3A, 0x3B
void kellyPoll() {
    static enum { KIDLE, KWAIT } state = KIDLE;
    static uint8_t  block[KELLY_N_POLL * 16];
    static uint32_t slot_ms[KELLY_N_POLL] = {0};   // when each slot last refreshed
    static uint8_t  rxbuf[40];
    static uint8_t  rxlen  = 0;
    static uint8_t  cur    = 0;      // command index currently in flight
    static uint32_t next_ms = 0;     // earliest time to send the next query
    static uint32_t sent_ms = 0;     // when the current query went out
    static uint32_t sent_rx_total = 0;   // g_kelly_rx_total when the query went out

    uint32_t now = millis();

    if (state == KIDLE) {
        if (now < next_ms) return;
        rxlen = 0;
        while (kelly.available()) kelly.read();   // drop stale bytes
        g_kelly_polls++;
        kellySendQuery(KELLY_MON_CMDS[cur]);
        sent_ms = now;
        sent_rx_total = g_kelly_rx_total;
        state   = KWAIT;
        return;
    }

    // KWAIT: gather the reply for command `cur`, resync on [CMD, 0x10, <16>, CHK].
    while (kelly.available() && rxlen < sizeof(rxbuf)) {
        rxbuf[rxlen++] = (uint8_t)kelly.read();
        g_kelly_rx_total++;
    }
    if (rxlen > 0) {   // snapshot for /json kelly_dbg
        g_kelly_last_rx_len = rxlen < 32 ? rxlen : 32;
        memcpy(g_kelly_last_rx, rxbuf, g_kelly_last_rx_len);
    }
    uint8_t cmd = KELLY_MON_CMDS[cur];
    for (int i = 0; i + 19 <= rxlen; i++) {
        if (rxbuf[i] != cmd || rxbuf[i + 1] != 0x10) continue;
        uint16_t sum = cmd + 0x10;
        for (int j = 0; j < 16; j++) sum += rxbuf[i + 2 + j];
        if ((sum & 0xFF) != rxbuf[i + 18]) continue;   // bad frame: keep scanning
        // Good reply — cache this slot.
        g_kelly_frames_ok++;
        g_kelly_last_frame_ms = now;   // drives the yellow LED heartbeat
        memcpy(&block[cur * 16], &rxbuf[i + 2], 16);
        slot_ms[cur] = now ? now : 1;
        // Rebuild the reading if every slot is populated and recently fresh.
        bool all_fresh = true;
        for (uint8_t s = 0; s < KELLY_N_POLL; s++)
            if (!slot_ms[s] || (now - slot_ms[s]) >= KELLY_STALE_MS) all_fresh = false;
        if (all_fresh) {
            kellyDecodeBlock(block);
            g_kelly_blocks_ok++;
            if (g_kelly_last_block_ms != 0) {
                uint32_t gap = now - g_kelly_last_block_ms;
                if (gap > g_kelly_block_gap_max_ms) g_kelly_block_gap_max_ms = gap;
            }
            g_kelly_last_block_ms = now;
        }
        cur     = (cur + 1) % KELLY_N_POLL;   // next command
        next_ms = now + KELLY_POLL_INTERVAL_MS;
        state   = KIDLE;
        return;
    }
    // No match: slide the window instead of jamming. The Kelly's line can
    // carry a second continuous transmission (~19.9k stream) plus noise, so a
    // fixed snapshot fills with non-reply bytes before the reply arrives.
    // Every start position the scan just exhausted is dead; keep only the
    // tail that could still begin a frame, so the reply is found no matter
    // how much chatter precedes it.
    if (rxlen > 18) {
        memmove(rxbuf, rxbuf + rxlen - 18, 18);
        rxlen = 18;
    }
    if (now - sent_ms > KELLY_CMD_TIMEOUT_MS) {   // no valid reply this attempt
        if (g_kelly_rx_total == sent_rx_total)
            g_kelly_timeouts++;                   // silence: unpowered/absent, not corruption
        else
            g_kelly_frames_bad++;                 // one clean count per failed attempt
        cur     = (cur + 1) % KELLY_N_POLL;       // advance so a dead slot can't stall
        next_ms = now + KELLY_POLL_INTERVAL_MS;
        state   = KIDLE;
    }
}

// ── Kelly flash-config read (read-only, on-demand) ──────────────────────────
// Blocking read of the 512-byte configuration region, mirroring
// solectrac-kelly-dump-config.py. Unlike kellyPoll's cooperative state machine
// this runs to completion synchronously (inside the /kelly/config web handler),
// so the whole burst owns the UART with no monitor query interleaved. It is
// deliberately never called from loop() — only from a manual request.

// Read exactly n bytes from the Kelly, or false on timeout at `deadline`.
static bool kellyReadExact(uint8_t* buf, size_t n, uint32_t deadline) {
    size_t got = 0;
    while (got < n) {
        if ((int32_t)(millis() - deadline) >= 0) return false;   // wrap-safe
        if (kelly.available()) buf[got++] = (uint8_t)kelly.read();
        else delay(1);   // yields to WiFi/other tasks while we wait
    }
    return true;
}

