schmmd/soleCAN/esp32-s3/src/main.cpp
// Read one checksum-valid ETS reply for `cmd`, resyncing on the echoed command
// byte. Fills out[len] (len<=16) and *out_len. False on timeout.
static bool kellyReadReply(uint8_t cmd, uint8_t* out, uint8_t* out_len) {
    const uint32_t deadline = millis() + KELLY_FLASH_TIMEOUT_MS;
    while ((int32_t)(millis() - deadline) < 0) {
        uint8_t b;
        if (!kellyReadExact(&b, 1, deadline)) return false;
        if (b != cmd) continue;                      // resync on echoed CMD
        uint8_t len;
        if (!kellyReadExact(&len, 1, deadline)) return false;
        if (len > 16) continue;                      // not a frame we expect
        uint8_t body[17];                            // len data bytes + checksum
        if (!kellyReadExact(body, (size_t)len + 1, deadline)) return false;
        uint16_t sum = (uint16_t)cmd + len;
        for (uint8_t j = 0; j < len; j++) sum += body[j];
        if ((uint8_t)(sum & 0xFF) != body[len]) continue;   // bad checksum: keep scanning
        if (out) memcpy(out, body, len);
        if (out_len) *out_len = len;
        return true;
    }
    return false;
}

// Fill flash[512] from the controller. Returns the number of 16-byte blocks
// successfully read (32 = full), or -1 if no flash session could be opened
// (controller unpowered/absent). Bounded to ~3 s total so a flaky or silent
// link can't stall the web handler indefinitely; unread blocks are zero-filled.
static int kellyReadFlash(uint8_t* flash) {
    const uint32_t start = millis();
    const uint32_t OVERALL_MS = 3000;
    while (kelly.available()) kelly.read();           // clear stale monitor bytes

    const uint8_t open_frame[3] = {0xF1, 0x00, 0xF1}; // [CMD, LEN=0, CHK=CMD]
    kelly.write(open_frame, sizeof(open_frame));
    uint8_t tmp[16], tlen;
    if (!kellyReadReply(0xF1, tmp, &tlen)) return -1;  // session never opened

    int ok = 0;
    for (int blk = 0; blk < 32; blk++) {
        uint16_t addr = (uint16_t)blk * 16;
        uint8_t lo = addr & 0xFF, hi = (addr >> 8) & 0xFF;
        // read frame: [0xF2, LEN=3, lo, 0x10 (count), hi, CHK]
        uint8_t chk = (uint8_t)(0xF2 + 0x03 + lo + 0x10 + hi);
        uint8_t frame[6] = {0xF2, 0x03, lo, 0x10, hi, chk};
        bool got = false;
        for (int attempt = 0; attempt < 2 && !got; attempt++) {
            if (millis() - start > OVERALL_MS) break;
            while (kelly.available()) kelly.read();
            kelly.write(frame, sizeof(frame));
            uint8_t data[16], dlen;
            if (kellyReadReply(0xF2, data, &dlen) && dlen == 16) {
                memcpy(flash + addr, data, 16);
                got = true;
            }
        }
        if (got) ok++;
        else memset(flash + addr, 0, 16);
        if (millis() - start > OVERALL_MS) {          // out of time: zero the rest
            for (int r = blk + 1; r < 32; r++) memset(flash + r * 16, 0, 16);
            break;
        }
    }
    return ok;
}
#endif  // ENABLE_KELLY

// ── JSON builder ──────────────────────────────────────────────────────────────

static void addFloat(JsonObject& obj, const char* key, float v, int decimals = 2) {
    if (!isnan(v)) {
        float factor = 1.0f;
        for (int i = 0; i < decimals; i++) factor *= 10.0f;
        obj[key] = roundf(v * factor) / factor;
    }
}

// `minimal` strips fields the HTML dashboard doesn't render — used to cut BLE
// payload size. The full set is still served at /json. Note the per-cell
// voltage/temperature arrays are NOT stripped: the cell-detail view renders
// them over BLE too.
String buildJson(bool pretty = true, bool minimal = false) {
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif
#ifdef GIT_VERSION
    if (GIT_VERSION[0]) doc["release"] = GIT_VERSION;   // tag, on release builds only
#endif

    // CAN bus health
    auto can = doc["can"].to<JsonObject>();
    if (!g_can_initialized) {
        can["state"] = "not_initialized";
    } else {
        twai_status_info_t si;
        if (twai_get_status_info(&si) == ESP_OK) {
            switch (si.state) {
                case TWAI_STATE_STOPPED:    can["state"] = "stopped";    break;
                case TWAI_STATE_RUNNING:    can["state"] = "running";    break;
                case TWAI_STATE_BUS_OFF:    can["state"] = "bus_off";    break;
                case TWAI_STATE_RECOVERING: can["state"] = "recovering"; break;
                default:                    can["state"] = "unknown";    break;
            }
            if (!minimal) {
                can["tec"]        = si.tx_error_counter;
                can["rec"]        = si.rx_error_counter;
                can["rx_missed"]  = si.rx_missed_count;
                can["bus_errors"] = si.bus_error_count;
                can["bus_recoveries"] = g_can_recoveries;
            }
        }
    }
    can["frames_rx"]      = g_frames_rx;
    if (!minimal) can["mode"] = CAN_TX_ENABLED ? "normal" : "listen_only";
    if (!minimal) can["frames_decoded"] = g_frames_decoded;
    if (!minimal && g_socketcand_tx_dropped)
        can["socketcand_dropped"] = g_socketcand_tx_dropped;
    if (!minimal && g_slcan_tx_dropped)
        can["slcan_dropped"] = g_slcan_tx_dropped;
    if (g_frames_rx > 0)
        can["last_frame_age_s"] = (millis() - g_last_frame_ms) / 1000.0;
#if defined(HAS_MCP2515)
    auto mcp = can["mcp2515"].to<JsonObject>();
    mcp["initialized"] = g_mcp_initialized;
    mcp["init_err"]    = g_mcp_init_err;
    mcp["frames_rx"]   = g_mcp_frames_rx;
    if (!minimal && g_mcp_initialized) {
        // Error-state visibility for can1, matching can0's tec/rec above.
        // Each accessor is one short SPI register read. eflg is the raw EFLG
        // register: bit 5 TXBO (bus-off), bits 4/3 TXEP/RXEP (error-passive),
        // bits 7/6 RX1OVR/RX0OVR (RX buffer overflow).
        mcp["tec"]  = g_mcp.transmitErrorCounter();
        mcp["rec"]  = g_mcp.receiveErrorCounter();
        mcp["eflg"] = g_mcp.errorFlagRegister();
    }
#endif

    // Pack
    auto pack = doc["pack"].to<JsonObject>();
    addFloat(pack, "voltage_v",    g_pack.voltage_v, 2);
    addFloat(pack, "current_a",    g_pack.current_a, 1);
    if (!minimal && g_pack.current_raw >= 0) pack["current_raw"] = g_pack.current_raw;
    addFloat(pack, "power_w",      g_pack.power_w,   1);
    if (!minimal && g_pack.soc_raw) pack["soc_raw"] = g_pack.soc_raw;
    addFloat(pack, "soc_pct",      g_pack.soc_pct,   1);
    if (!minimal) addFloat(pack, "v_estimate", g_pack.v_estimate, 3);
    auto cells_obj = pack["cells"].to<JsonObject>();
    if (g_pack.cell_max_mv >= 0)   cells_obj["max_mv"]    = g_pack.cell_max_mv;
    if (g_pack.cell_min_mv >= 0)   cells_obj["min_mv"]    = g_pack.cell_min_mv;
    if (g_pack.cell_spread_mv >= 0)cells_obj["spread_mv"] = g_pack.cell_spread_mv;
    if (g_pack.cell_max_n)         cells_obj["max_n"]     = g_pack.cell_max_n;
    if (g_pack.cell_min_n)         cells_obj["min_n"]     = g_pack.cell_min_n;
    if (!minimal && g_pack.cell_spread_mv_reported >= 0)
        cells_obj["spread_mv_reported"] = g_pack.cell_spread_mv_reported;
    auto temp = cells_obj["temp_summary"].to<JsonObject>();
    if (g_pack.temp_max_c != INT8_MIN) temp["max_c"]    = g_pack.temp_max_c;
    if (g_pack.temp_min_c != INT8_MIN) temp["min_c"]    = g_pack.temp_min_c;
    if (!minimal) {
        if (g_pack.temp_max_n)             temp["max_n"]    = g_pack.temp_max_n;
        if (g_pack.temp_min_n)             temp["min_n"]    = g_pack.temp_min_n;
        if (g_pack.temp_spread_c >= 0)     temp["spread_c"] = g_pack.temp_spread_c;
    }

    // Session energy summary.
    // Convention: positive = into pack (net charge), negative = out (net draw).
    auto sess = doc["session"].to<JsonObject>();
    sess["wh_drawn"]   = roundf(g_session_wh_drawn   * 10.0f) / 10.0f;
    sess["wh_charged"] = roundf(g_session_wh_charged * 10.0f) / 10.0f;
    sess["wh_net"]     = roundf((g_session_wh_charged - g_session_wh_drawn) * 10.0f) / 10.0f;
    sess["wh_capacity"] = PACK_CAPACITY_WH;
    if (!isnan(g_session_soc_start_pct))
        sess["soc_start_pct"] = roundf(g_session_soc_start_pct * 10.0f) / 10.0f;

    // Session-average net power. Positive = net charging, negative = net drawing.
    // Uses *active* time (sum of valid dt's), so bus-silent gaps don't dilute it.
    float avg_power_w = NAN;
    float active_hours = g_session_active_ms / 3600000.0f;
    if (active_hours > 0.01f) {                            // ≥ ~36 s of data
        avg_power_w = (g_session_wh_charged - g_session_wh_drawn) / active_hours;
        if (!minimal) {
            sess["avg_power_w"] = roundf(avg_power_w * 10.0f) / 10.0f;
            sess["active_s"]    = g_session_active_ms / 1000;
        }
    }

    if (!isnan(g_pack.soc_pct)) {
        float remaining = g_pack.soc_pct * PACK_CAPACITY_WH / 100.0f;
        sess["wh_remaining"] = roundf(remaining * 10.0f) / 10.0f;
        // ETAs use session-average power so they don't jump with instantaneous load
        if (!isnan(avg_power_w)) {
            if (avg_power_w < -50.0f) {
                // Net drawing — extrapolate to empty.
                sess["eta_to_zero_s"] = (uint32_t)(remaining / -avg_power_w * 3600.0f);
            } else if (avg_power_w > 50.0f) {
                // Net charging — extrapolate to full.
                float headroom = PACK_CAPACITY_WH - remaining;
                if (headroom > 0)
                    sess["eta_to_full_s"] = (uint32_t)(headroom / avg_power_w * 3600.0f);
            }
        }
    }

