schmmd/soleCAN/esp32-s3/src/main.cpp
    // Current USB port role (small, device-wide fact — emitted even in the
    // minimal/BLE snapshot so any client can see the mode).
    doc["usb"]["mode"] = usbModeName(g_usb_mode);

    String out;
    if (pretty) serializeJsonPretty(doc, out);
    else        serializeJson(doc, out);
    return out;
}

// ── HTTP handlers ─────────────────────────────────────────────────────────────

// Declared here (ahead of the "── SLCAN ──" section below, which owns and
// documents them) purely so handleWifiSave's boot-log line can test
// slcan_open before that section runs at file scope.
static char   slcan_buf[32];
static uint8_t slcan_len = 0;
static bool   slcan_open = false;

// ── Device log ring ───────────────────────────────────────────────────────────
// A small in-RAM ring of recent device-status lines, served at GET /logs so the
// log is readable over WiFi in any USB mode. logLine() also echoes to USB when
// the port isn't carrying a binary stream. Appends come from both the main loop
// and the WiFi event task, so the ring is guarded by a spinlock.
static portMUX_TYPE g_log_mux = portMUX_INITIALIZER_UNLOCKED;
static char   g_log_ring[3072];
static size_t g_log_head    = 0;
static bool   g_log_wrapped = false;

// USB text may be written only when the port isn't a binary channel — i.e. not
// mid-SLCAN-session and not the kelly bridge. (slcan_open only goes true in slcan
// mode, so logging and pre-session slcan both allow text.)
static inline bool usbTextAllowed() {
    return g_usb_mode != USB_KELLY && !slcan_open;
}

// Append one formatted line to the ring, and echo it to USB when allowed.
void logLine(const char* fmt, ...) {
    char buf[192];
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf, sizeof(buf) - 2, fmt, ap);
    va_end(ap);
    if (n < 0) return;
    if (n > (int)sizeof(buf) - 2) n = sizeof(buf) - 2;
    buf[n++] = '\r';
    buf[n++] = '\n';
    portENTER_CRITICAL(&g_log_mux);
    for (int i = 0; i < n; i++) {
        g_log_ring[g_log_head++] = buf[i];
        if (g_log_head >= sizeof(g_log_ring)) { g_log_head = 0; g_log_wrapped = true; }
    }
    portEXIT_CRITICAL(&g_log_mux);
    if (usbTextAllowed()) Serial.write((const uint8_t*)buf, n);
}

// Marks a served request so an active web client (dashboard poller, file
// download) defers the CAN-quiet deep sleep — see checkCanQuietSleep(). Called
// at the top of every real endpoint but deliberately NOT from handleNotFound:
// an idle phone joined to the AP fires captive-portal probes at unknown paths,
// and counting those would keep the board awake forever.
static inline void noteHttpActivity() { g_last_http_ms = millis(); }

void handleJson() {
    noteHttpActivity();
    server.send(200, "application/json", buildJson());
}

// Names for the STA disconnect reasons that come up when a credentials build
// goes wrong: auth_fail / handshake_timeout usually mean a wrong password,
// no_ap_found a wrong SSID or out-of-range network. Rare codes stay numeric.
static String staDisconnectReasonName(uint8_t reason) {
    switch (reason) {
        case WIFI_REASON_UNSPECIFIED:                return "unspecified";
        case WIFI_REASON_AUTH_EXPIRE:                return "auth_expire";
        case WIFI_REASON_AUTH_LEAVE:                 return "auth_leave";
        case WIFI_REASON_ASSOC_EXPIRE:               return "assoc_expire";
        case WIFI_REASON_ASSOC_TOOMANY:              return "assoc_toomany";
        case WIFI_REASON_NOT_AUTHED:                 return "not_authed";
        case WIFI_REASON_NOT_ASSOCED:                return "not_assoced";
        case WIFI_REASON_ASSOC_LEAVE:                return "assoc_leave";
        case WIFI_REASON_MIC_FAILURE:                return "mic_failure";
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:     return "4way_handshake_timeout";
        case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT:   return "group_key_update_timeout";
        case WIFI_REASON_802_1X_AUTH_FAILED:         return "802_1x_auth_failed";
        case WIFI_REASON_BEACON_TIMEOUT:             return "beacon_timeout";
        case WIFI_REASON_NO_AP_FOUND:                return "no_ap_found";
        case WIFI_REASON_AUTH_FAIL:                  return "auth_fail";
        case WIFI_REASON_ASSOC_FAIL:                 return "assoc_fail";
        case WIFI_REASON_HANDSHAKE_TIMEOUT:          return "handshake_timeout";
        case WIFI_REASON_CONNECTION_FAIL:            return "connection_fail";
        case WIFI_REASON_AP_TSF_RESET:               return "ap_tsf_reset";
        case WIFI_REASON_ROAMING:                    return "roaming";
        default:                                     return String(reason);
    }
}

// Build + WiFi diagnostics, deliberately separate from the /json telemetry.
// board/version/features and the AP identity are what was baked into the
// binary; the station (sta) fields report the *active* credentials, which come
// from NVS when set at runtime via /wifi and otherwise fall back to the
// compiled WIFI_SSID/WIFI_PASS defaults. The soft-AP is always up, so /config
// stays reachable at 192.168.4.1 even when the STA join failed — one request
// distinguishes "wrong password" from "wrong SSID" from "no station configured".
void handleConfig() {
    noteHttpActivity();
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif
#ifdef GIT_VERSION
    if (GIT_VERSION[0]) doc["release"] = GIT_VERSION;   // tag, on release builds only
#endif
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
    doc["board"] = "adafruit_feather_s3";
#elif defined(BOARD_LILYGO_T2CAN)
    doc["board"] = "lilygo_t2can";
#elif defined(BOARD_REJSACAN)
    doc["board"] = "rejsacan";
#endif
    doc["mdns"] = MDNS_NAME;

    auto features = doc["features"].to<JsonObject>();
    features["can_tx"]    = (bool)CAN_TX_ENABLED;
#if defined(HAS_MCP2515)
    features["mcp2515"]   = true;
#else
    features["mcp2515"]   = false;
#endif
#if defined(HAS_VIN_SENSE)
    features["vin_sense"] = true;
#else
    features["vin_sense"] = false;
#endif

    auto wifi = doc["wifi"].to<JsonObject>();

    auto sta = wifi["sta"].to<JsonObject>();
    const bool join_sta = staConfigured();
    sta["ssid"]     = g_sta_ssid;                   // active STA SSID (NVS or default)
    sta["pass_set"] = (g_sta_pass[0] != '\0');      // presence only, never the password
    sta["enabled"]  = join_sta;
    const bool sta_connected = join_sta && WiFi.status() == WL_CONNECTED;
    sta["status"] = !join_sta ? "disabled"
                  : sta_connected ? "connected" : "connecting";
    if (sta_connected) {
        sta["ip"]   = WiFi.localIP().toString();
        sta["rssi"] = WiFi.RSSI();
    }
    sta["disconnects"] = (uint32_t)g_sta_disconnects;
    if (g_sta_disconnects > 0)
        sta["last_disconnect_reason"] =
            staDisconnectReasonName(g_sta_last_disconnect_reason);

