schmmd/soleCAN/esp32-s3/src/main.cpp
// GET /logs — dump the recent device-log ring (oldest -> newest) as text. The ring
// bytes are snapshotted under the spinlock into a local buffer, then sent outside
// the critical section (no heap work while interrupts are masked).
void handleLog() {
    noteHttpActivity();
    static char snap[sizeof(g_log_ring) + 1];
    size_t len;
    portENTER_CRITICAL(&g_log_mux);
    if (g_log_wrapped) {
        size_t tail = sizeof(g_log_ring) - g_log_head;
        memcpy(snap, g_log_ring + g_log_head, tail);
        memcpy(snap + tail, g_log_ring, g_log_head);
        len = sizeof(g_log_ring);
    } else {
        memcpy(snap, g_log_ring, g_log_head);
        len = g_log_head;
    }
    portEXIT_CRITICAL(&g_log_mux);
    snap[len] = '\0';
    server.send(200, "text/plain", len ? snap : "(no log yet)\r\n");
}

// Apply new STA credentials: AP-password gated, validated, persisted to NVS,
// then live re-join (no reboot). The soft-AP stays up throughout.
void handleWifiSave() {
    noteHttpActivity();
    if (!secretEquals(server.arg("ap_pass"), AP_PASS)) {
        server.send(401, "text/plain", "wrong AP password\n");
        return;
    }
    String ssid = server.arg("ssid");
    String pass = server.arg("pass");
    if (ssid.length() > 32) {
        server.send(400, "text/plain", "SSID too long (max 32)\n");
        return;
    }
    if (pass.length() != 0 && (pass.length() < 8 || pass.length() > 63)) {
        server.send(400, "text/plain",
                    "password must be empty or 8-63 chars (WPA2)\n");
        return;
    }

    strlcpy(g_sta_ssid, ssid.c_str(), sizeof(g_sta_ssid));
    strlcpy(g_sta_pass, pass.c_str(), sizeof(g_sta_pass));
    saveStaCreds(g_sta_ssid, g_sta_pass);

    WiFi.mode(staConfigured() ? WIFI_AP_STA : WIFI_AP);
    WiFi.disconnect(false);
    if (staConfigured()) WiFi.begin(g_sta_ssid, g_sta_pass);

    logLine("WiFi: STA reconfigured to \"%s\" (pass %u chars)",
            g_sta_ssid, (unsigned)strlen(g_sta_pass));

    String msg = staConfigured()
        ? String("saved; re-joining \"") + g_sta_ssid + "\"\n"
        : String("saved; STA disabled (AP only)\n");
    server.send(200, "text/plain", msg);
}

void handleRoot() {
    noteHttpActivity();
    // HTML lives in src/dashboard.html; embedded via board_build.embed_txtfiles.
    // Length excludes the trailing null byte that embed_txtfiles appends.
    size_t len = dashboard_html_end - dashboard_html_start - 1;
    server.send_P(200, "text/html", (PGM_P)dashboard_html_start, len);
}

#if defined(HAS_SD)
// ── SD file access API ────────────────────────────────────────────────────────
// See docs/superpowers/specs/2026-07-18-sd-file-api-design.md. /sd/status is
// in-RAM only (poll freely); /sd/sessions, /sd/sessions/{id} GET (tar) and DELETE
// touch the card under g_sd_mutex and answer 503 unless a session is logging.

// Minimal built-in browser UI at /sd: shows /sd/status and the /sd/sessions
// inventory, each session with a download link (its tar). Self-contained — no embedded
// asset, no external resources — so it costs only this string in flash. It
// fetches the two JSON endpoints once on load (Refresh re-fetches); it does not
// poll, so an open tab won't keep the board awake past the download.
static const char SD_INDEX_HTML[] PROGMEM = R"HTML(<!doctype html>
<meta charset=utf-8>
<meta name=viewport content="width=device-width,initial-scale=1">
<title>SD sessions</title>
<style>
 body{font:14px/1.5 system-ui,sans-serif;margin:1rem;max-width:760px}
 h1{font-size:1.1rem}
 #status{margin:.5rem 0;padding:.5rem .7rem;border:1px solid #ccc;border-radius:6px}
 table{border-collapse:collapse;width:100%}
 th,td{text-align:left;padding:.35rem .5rem;border-bottom:1px solid #ddd}
 td.num,th.num{text-align:right;font-variant-numeric:tabular-nums}
 .muted{color:#777}
 button{font:inherit;padding:.2rem .7rem}
 @media (prefers-color-scheme:dark){
  body{background:#111;color:#ddd}#status{border-color:#444}
  th,td{border-color:#333}a{color:#6bf}}
</style>
<h1>SD sessions</h1>
<div id=status class=muted>Loading&hellip;</div>
<p><button onclick=load()>Refresh</button> <span id=err class=muted></span></p>
<table><thead><tr><th>Session<th class=num>Files<th class=num>Size<th>Download</thead>
<tbody id=rows></tbody></table>
<script>
function mb(kb){return((kb||0)/1024).toFixed(1)+' MB'}
function human(b){if(b==null)return'';var u=['B','KB','MB','GB'],i=0;b=+b;
 while(b>=1024&&i<u.length-1){b/=1024;i++}return b.toFixed(i?1:0)+' '+u[i]}
function pad(n){return 's'+String(n).padStart(5,'0')}
async function jget(u){var r=await fetch(u);if(!r.ok)throw Error(u+' → '+r.status);return r.json()}
async function loadStatus(){var el=document.getElementById('status');
 try{var s=await jget('/sd/status'),t=s.state;
  if(s.state==='logging')t='logging '+pad(s.session)+' · '+mb(s.kb_written)+
   ' written · '+human((s.free_mb||0)*1048576)+' free';
  el.textContent=t;el.className='';
 }catch(e){el.textContent='status: '+e.message;el.className='muted'}}
async function loadList(){var tb=document.getElementById('rows'),err=document.getElementById('err');
 try{var d=await jget('/sd/sessions');err.textContent='';
  tb.innerHTML=(d.sessions||[]).sort(function(a,b){return b.id-a.id}).map(function(s){
   return '<tr><td>'+pad(s.id)+(s.active?' <span class=muted>(active)</span>':'')+
    '<td class=num>'+((s.files||[]).length)+'<td class=num>'+human(s.bytes)+
    '<td><a href="/sd/sessions/'+s.id+'" download>'+pad(s.id)+'.tar</a>';
  }).join('')||'<tr><td colspan=4 class=muted>No sessions</td></tr>';
 }catch(e){err.textContent=e.message}}
function load(){loadStatus();loadList()}
load();
</script>
)HTML";

static void handleSdIndex() {
    noteHttpActivity();
    server.send_P(200, "text/html", SD_INDEX_HTML);
}

static void sdSendError(int code, const char* msg) {
    server.send(code, "application/json",
                String("{\"error\":\"") + msg + "\"}");
}

// Cheap logging status + the diagnostics that used to ride along in /json
// (raw_part, json_part, recoveries, fail_op, fail_kb). No mutex, no card I/O.
static void handleSdStatus() {
    noteHttpActivity();
    JsonDocument doc;
    doc["state"] = g_sd.state;
    if (g_sd_active) {
        doc["session"]    = g_sd.session;
        doc["raw_part"]   = g_sd_raw.part;
        doc["json_part"]  = g_sd_json.part;
        doc["kb_written"] = g_sd.kb_written;
        doc["free_mb"]    = g_sd.free_mb;
    }
    if (g_sd_raw.dropped)  doc["raw_dropped"]  = g_sd_raw.dropped;
    if (g_sd_json.dropped) doc["json_dropped"] = g_sd_json.dropped;
    if (g_sd.recoveries)   doc["recoveries"]   = g_sd.recoveries;
    if (g_sd.fail_op[0]) {
        doc["fail_op"] = g_sd.fail_op;
        doc["fail_kb"] = g_sd.fail_kb;
    }
    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

// Session/file inventory: one mutex-guarded walk of the card. Only /sNNNNN
// directories are listed (same sdParseSession() filter as the reaper).
static void handleSdList() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    JsonDocument doc;
    auto sessions = doc["sessions"].to<JsonArray>();
    bool open_ok = true;
    {
        SdLock lock;
        File root = SD.open("/");
        if (!root) { open_ok = false; }
        else {
        for (File e = root.openNextFile(); e; e = root.openNextFile()) {
            uint32_t n;
            if (e.isDirectory() && sdParseSession(sdBasename(e.name()), n)) {
                auto s = sessions.add<JsonObject>();
                s["id"]     = n;
                s["active"] = (n == g_sd.session);
                uint64_t total = 0;
                char path[16];
                snprintf(path, sizeof path, "/s%05lu", (unsigned long)n);
                auto files = s["files"].to<JsonArray>();
                File d = SD.open(path);
                if (d) {
                    for (File f = d.openNextFile(); f; f = d.openNextFile()) {
                        if (!f.isDirectory()) {
                            auto fo = files.add<JsonObject>();
                            fo["name"] = sdBasename(f.name());   // ArduinoJson 7 copies
                            fo["size"] = (uint32_t)f.size();
                            total += f.size();
                        }
                        f.close();
                    }
                    d.close();
                }
                s["bytes"] = total;
            }
            e.close();
        }
        root.close();
        }
    }
    if (!open_ok) { sdSendError(500, "open_root"); return; }
    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

// Minimal USTAR header for one regular file. `name` ("s00042/can_00.asc") is
// far below the 100-byte field. mtime is 0 — the ESP32 has no RTC, matching
// the nominal date in the .asc header.
static void tarFillHeader(uint8_t hdr[512], const char* name, uint32_t size) {
    memset(hdr, 0, 512);
    strncpy((char*)hdr, name, 99);                 // name
    memcpy(hdr + 100, "0000644", 8);               // mode
    memcpy(hdr + 108, "0000000", 8);               // uid
    memcpy(hdr + 116, "0000000", 8);               // gid
    char oct[13];
    snprintf(oct, sizeof oct, "%011lo", (unsigned long)size);
    memcpy(hdr + 124, oct, 12);                    // size
    memcpy(hdr + 136, "00000000000", 12);          // mtime
    hdr[156] = '0';                                // typeflag: regular file
    memcpy(hdr + 257, "ustar", 6);                 // magic (NUL-terminated)
    memcpy(hdr + 263, "00", 2);                    // version
    memset(hdr + 148, ' ', 8);                     // checksum: spaces while summing
    uint32_t sum = 0;
    for (int i = 0; i < 512; i++) sum += hdr[i];
    snprintf(oct, sizeof oct, "%06lo", (unsigned long)sum);
    memcpy(hdr + 148, oct, 6);
    hdr[154] = '\0';
    hdr[155] = ' ';
}

// Push `n` bytes to the client, tolerating partial writes. Bounded retries so
// a wedged socket can't hang the loop task forever.
static bool sdClientWrite(WiFiClient& client, const uint8_t* p, size_t n) {
    int stalls = 0;
    while (n) {
        if (!client.connected()) return false;
        size_t w = client.write(p, n);
        if (w == 0) {
            if (++stalls > 50) return false;
            delay(2);
            continue;
        }
        stalls = 0;
        p += w;
        n -= w;
    }
    return true;
}

