schmmd/soleCAN/esp32-s3/src/main.cpp
void handleNotFound() {
    // The soft-AP's wildcard DNS lands every hostname here, including phone
    // connectivity probes (generate_204 / hotspot-detect.html). Answering
    // those with a redirect — not a 404 — makes the OS classify the AP as a
    // captive portal and auto-open the dashboard when someone joins.
    // localIP() is the board's address on whichever interface the request
    // arrived on, so it also tells AP requests apart from station ones: on the
    // bench network there's no wildcard DNS and no portal to satisfy, so a
    // mistyped path should say 404 rather than silently bounce to the root.
    IPAddress local = server.client().localIP();
    if (local != WiFi.softAPIP()) {
        server.send(404, "text/plain", "Not found: " + server.uri() + "\n");
        return;
    }
    server.sendHeader("Location", "http://" + local.toString() + "/");
    server.send(302, "text/plain", "");
}

// ── USB mode: console `mode` command + logging-mode input/heartbeat ───────────
// Recognizes a `mode` line typed over the USB console. `mode` alone reports the
// current + available modes; `mode <name>` switches. Returns true if the line was
// a mode command, so the SLCAN handler can consume it before its own parsing.
static bool tryModeCommand(const char* line) {
    if (strncmp(line, "mode", 4) != 0) return false;
    const char* p = line + 4;
    while (*p == ' ' || *p == '\t') p++;
    if (*p == '\0') {                       // bare `mode` -> report
        Serial.printf("usb mode: %s (available: logging slcan"
#if defined(ENABLE_KELLY)
                      " kelly"
#endif
                      ")\r\n", usbModeName(g_usb_mode));
        return true;
    }
    char name[16]; size_t n = 0;            // first whitespace-delimited token
    while (p[n] && p[n] != ' ' && p[n] != '\t' && n < sizeof(name) - 1) {
        name[n] = p[n]; n++;
    }
    name[n] = '\0';
    UsbMode m;
    if (usbModeFromName(String(name), m)) {
        g_usb_mode = m;
        Serial.printf("usb mode -> %s\r\n", usbModeName(m));
    } else {
        Serial.printf("usb mode: unknown '%s'\r\n", name);
    }
    return true;
}

// Runs each loop iteration while in LOGGING mode: accepts a `mode` command typed
// over USB (other input discarded) and emits a ~10 s device-status heartbeat.
void usbLoggingPoll() {
    static char    buf[24];
    static uint8_t len = 0;
    while (Serial.available()) {            // (a) line-buffered `mode` command
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (len > 0) { buf[len] = '\0'; tryModeCommand(buf); len = 0; }
        } else if (len < sizeof(buf) - 1) {
            buf[len++] = c;
        } else {
            len = 0;                        // overlong line: reset (commands are short)
        }
    }

    static uint32_t next = 0;               // (b) periodic heartbeat
    uint32_t now = millis();
    if (now < next) return;
    next = now + 10000;
    uint32_t age = g_frames_rx ? (now - g_last_frame_ms) : 0;
    char msg[160];
    int w = snprintf(msg, sizeof(msg),
        "[%lus] usb=logging  can:%lu rx last %lus  wifi=%s  heap=%u",
        (unsigned long)(now / 1000), (unsigned long)g_frames_rx,
        (unsigned long)(age / 1000),
        WiFi.status() == WL_CONNECTED ? "sta" : (g_ap_running ? "ap" : "down"),
        (unsigned)ESP.getFreeHeap());
#if defined(ENABLE_KELLY)
    if (g_kelly.valid && w > 0 && w < (int)sizeof(msg))
        snprintf(msg + w, sizeof(msg) - w, "  kelly:%lu rx last %lus",
                 (unsigned long)g_kelly_blocks_ok,
                 (unsigned long)((now - g_kelly.last_seen_ms) / 1000));
#endif
    logLine("%s", msg);
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'
// Receive always works; transmit (t/T commands) is gated on -DCAN_ALLOW_TX and
// routes to can0 (the native TWAI controller) only — SLCAN has no channel
// concept, so it never reaches the MCP2515 (can1). A listen-only build answers
// every t/T with BELL.

// slcan_buf/slcan_len/slcan_open are declared near the top of the
// "── HTTP handlers ──" section (main.cpp:1902-1904, ahead of this section)
// so handleWifiSave's boot-log line can reference slcan_open before this
// section runs at file scope.

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open) return;
    char line[32];
    // 'T' + 8 hex ID digits for 29-bit frames, 't' + 3 for 11-bit.
    int n = msg.extd
        ? snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                   msg.identifier, msg.data_length_code)
        : snprintf(line, sizeof(line), "t%03" PRIX32 "%u",
                   msg.identifier, msg.data_length_code);
    // Bound n so the two hex digits and the trailing '\r' always fit: if n
    // ever passed sizeof(line), the sizeof(line) - n below would underflow
    // and line[n++] would land out of bounds. Unreachable while loop()
    // clamps DLC to 8, but the formatter shouldn't lean on that.
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 3; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    // Never block the CAN drain on a stalled USB host: if the CDC TX buffer
    // can't take the whole line, drop it (like the SD ring and the socketcand
    // tap) rather than stall loop() per frame. A reader that opened the SLCAN
    // tap but stopped draining — e.g. the bench soak, which holds the port open
    // while flooding the bus — would otherwise make every Serial.write() block,
    // starving HTTP/BLE and overflowing the RX queue under load.
    if (Serial.availableForWrite() >= n)
        Serial.write((uint8_t*)line, n);
    else
        g_slcan_tx_dropped++;
}

// Single hex digit -> 0..15, or -1 if not a hex character.
static int hexNibble(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}

#if CAN_TX_ENABLED
// Inject a frame onto can0 (native TWAI). Shared by the SLCAN t/T handler and
// the socketcand channel-0 `< send >` so the two TX paths can't drift. Returns
// true if the driver queued the frame. Only compiled when TX is enabled — in a
// listen-only build there is no code that can reach the bus.
static bool canTransmit0(uint32_t id, bool extd, uint8_t dlc, const uint8_t* data) {
    twai_message_t tx = {};
    tx.identifier       = id;
    tx.extd             = extd ? 1 : 0;
    tx.data_length_code = dlc;
    memcpy(tx.data, data, dlc);
    return twai_transmit(&tx, pdMS_TO_TICKS(10)) == ESP_OK;
}
#endif

