schmmd/soleCAN/esp32-s3/src/main.cpp
    if (join_sta)
        logLine("WiFi: AP \"%s\" %s; STA joining \"%s\" (pass %u chars)",
                AP_SSID, g_ap_running ? "up" : "FAILED",
                g_sta_ssid, (unsigned)strlen(g_sta_pass));
    else
        logLine("WiFi: AP \"%s\" %s; STA disabled (no SSID configured)",
                AP_SSID, g_ap_running ? "up" : "FAILED");

    // Wildcard DNS on the soft-AP: any hostname (tractor.local, tractor,
    // captive-portal probes, etc.) resolves to the board's AP IP. Needed
    // because phones generally don't do mDNS over an AP with no internet.
    if (g_ap_running) dns_server.start(53, "*", WiFi.softAPIP());

    MDNS.begin(MDNS_NAME);

    server.on("/",       handleRoot);
    server.on("/json",   handleJson);
    server.on("/config", handleConfig);
    server.on("/usb", HTTP_GET, handleUsbPage);   // USB-mode control page
    server.on("/usb", HTTP_POST, handleUsbPost);  // form submit -> 303 to /usb
    server.on("/usb", HTTP_PUT, handleUsbSet);    // set USB mode (JSON API)
    server.on("/logs", HTTP_GET, handleLog);      // recent device log (any mode)
#if defined(ENABLE_KELLY)
    server.on("/kelly/config", handleKellyConfig);
#endif
    server.on("/wifi", HTTP_GET,  handleWifiForm);
    server.on("/wifi", HTTP_POST, handleWifiSave);
#if defined(HAS_SD)
    server.on("/sd",        HTTP_GET, handleSdIndex);
    server.on("/sd/status", HTTP_GET, handleSdStatus);
    server.on("/sd/sessions",   HTTP_GET, handleSdList);
    server.on(UriBraces("/sd/sessions/{}"), HTTP_GET, handleSdSessionGet);
    server.on(UriBraces("/sd/sessions/{}"), HTTP_DELETE, handleSdSessionDelete);
#endif
    server.onNotFound(handleNotFound);
    server.begin();
    MDNS.addService("http", "tcp", 80);

    socketcand_server.begin();
    socketcand_server.setNoDelay(true);
    MDNS.addService("socketcand", "tcp", SOCKETCAND_PORT);
#endif  // !NO_WIFI

#if defined(HAS_MCP2515)
    // Release the MCP2515 from hardware reset before any SPI traffic. RESET is
    // active-low; pulse it low then high and let the oscillator settle. Without
    // this the chip stays held in reset and begin() returns kNoMCP2515.
    pinMode(MCP2515_RST_PIN, OUTPUT);
    digitalWrite(MCP2515_RST_PIN, LOW);
    delay(10);
    digitalWrite(MCP2515_RST_PIN, HIGH);
    delay(10);

    // Do NOT pass the CS pin to SPI.begin — Arduino-ESP32 would attach it as
    // hardware-SS and fight the library's software-CS control. The ACAN2515
    // library drives CS itself (it calls pinMode(CS, OUTPUT) in begin()).
    SPI.begin(MCP2515_SCK_PIN, MCP2515_MISO_PIN, MCP2515_MOSI_PIN);

    // ACAN2515Settings(quartz_Hz, bitrate). begin() issues the MCP2515 reset,
    // configures bit timing, installs the ISR, and returns 0 on success (a
    // non-zero code is a bitmask of configuration errors — e.g. an impossible
    // bitrate for the given crystal). Default filters accept every frame, which
    // is what we want for a sniffer. Mode tracks CAN_TX_ENABLED so can1 gets the
    // same passive-tap guarantee as can0: ListenOnly by default, Normal only
    // under -DCAN_ALLOW_TX.
    ACAN2515Settings mcp_cfg(MCP2515_QUARTZ_HZ, 250UL * 1000UL);
#if !CAN_TX_ENABLED
    mcp_cfg.mRequestedMode = ACAN2515Settings::ListenOnlyMode;
#endif
    g_mcp_init_err    = g_mcp.begin(mcp_cfg, [] { g_mcp.isr(); });
    g_mcp_initialized = (g_mcp_init_err == 0);
#endif

#if defined(HAS_SD)
    // Probe the microSD once. On success this arms g_sd_active and spawns the
    // writer task; on no-card/failure it's a no-op and the firmware runs as a
    // pure tap. Must precede loop(), which is where the producer is gated.
    sdInit();
#endif

#if !defined(NO_BLE)
    bleInit();
#endif
}

// Drain both CAN controllers and fan out to every consumer (J1939 decode,
// SLCAN, socketcand, SD raw ring), then emit the 1 Hz decoded jsonl snapshot.
// This is the *sole* CAN consumer, so it must run frequently even while a long
// HTTP handler monopolizes the loop task; the tar streamer calls it once per
// chunk for exactly that reason. Runs only on the loop task and never calls
// server.handleClient(), so it is single-threaded and not reentrant.
//
// The per-tick drain cap is a runaway-safety bound, not the fix for the
// device-test --sd-soak starvation — that was slcanSendFrame() blocking on a
// full USB-CDC buffer, now dropped non-blockingly like the other taps. The cap
// only guarantees the loop always returns to server.handleClient()/bleTick()
// even if a future per-frame consumer turns slow again. It equals the driver
// RX queue depth (rx_queue_len, see setup) so it drains the whole queue in one
// pass — capping *below* the queue would leave frames sitting that the loop
// could have taken, adding needless occupancy and rx_missed pressure — while
// still bounding the pathological "queue refills as fast as we drain" case at
// one queue's worth per tick.
#define CAN_RX_MAX_PER_TICK 512
static void canServiceTick() {
    twai_message_t msg;
    for (uint16_t drained = 0;
         drained < CAN_RX_MAX_PER_TICK && twai_receive(&msg, 0) == ESP_OK;
         drained++) {
        // Classic CAN allows DLC 9–15 on the wire (still only 8 data bytes)
        // and the driver passes the raw value through (flagged
        // TWAI_MSG_FLAG_DLC_NON_COMP). Clamp before fan-out so the SLCAN /
        // socketcand formatters never index past msg.data[].
        if (msg.data_length_code > 8) msg.data_length_code = 8;
        g_frames_rx++;
        g_last_frame_ms = millis();
        // J1939 decode applies only to 29-bit frames, but the raw taps
        // forward 11-bit frames too — the TWAI channel may be tapped onto a
        // standard-ID bus (e.g. the BMS UDS port at 0x740/0x748).
        if (msg.extd)
            decodeCAN(msg.identifier, msg.data, msg.data_length_code);
        slcanSendFrame(msg);
        socketcandSendFrame(msg, /*channel=*/0);
#if defined(HAS_SD)
        if (g_sd_active) sdEnqueueRaw(msg);   // no-op enqueue when no card
#endif
    }
#if defined(HAS_MCP2515)
    if (g_mcp_initialized) {
        CANMessage frame;
        // Same per-tick drain bound as the TWAI loop above: never let a
        // saturated CAN B (with, say, a back-pressuring socketcand client)
        // spin here forever and starve handleClient()/bleTick()/updateLed().
        // The ACAN2515 driver's own RX FIFO absorbs bursts between passes.
        for (uint16_t drained = 0;
             drained < CAN_RX_MAX_PER_TICK && g_mcp.receive(frame);
             drained++) {
            g_mcp_frames_rx++;
            // Counts as bus activity for the quiet-sleep timer too: the board
            // must not deep-sleep while CAN A still carries traffic (ext0 wake
            // only watches the TWAI RX pin, so a sleep here would be terminal
            // until CAN B traffic resumes).
            g_last_frame_ms = millis();
            twai_message_t fwd = {};
            fwd.identifier       = frame.id;
            fwd.extd             = frame.ext ? 1 : 0;
            fwd.data_length_code = frame.len <= 8 ? frame.len : 8;
            memcpy(fwd.data, frame.data, fwd.data_length_code);
            socketcandSendFrame(fwd, /*channel=*/1);
        }
    }
#endif
#if defined(HAS_SD)
    // Periodic decoded snapshot at SD_JSON_HZ (default 1 Hz), independent of any
    // client — buildJson() only runs on HTTP/BLE demand otherwise, so an
    // unattended session would log no JSON. Built here on the loop task, so the
    // decoded globals stay single-threaded; only the serialized line crosses to
    // the writer.
    if (g_sd_active) {
        static uint32_t last_json_ms = 0;
        uint32_t now = millis();
        if (now - last_json_ms >= 1000 / SD_JSON_HZ) {
            last_json_ms = now;
            sdEnqueueJson(buildJson(/*pretty=*/false, /*minimal=*/false));
        }
    }
#endif
}

void loop() {
    canServiceTick();
    canRecoveryTick();

    // USB port role (g_usb_mode). slcan parses USB as SLCAN; logging streams
    // device status + accepts a `mode` command; kelly is a transparent
    // USB<->Kelly bridge. `Serial` on the S3 is HWCDCSerial (native USB CDC).
    if      (g_usb_mode == USB_SLCAN)   slcanPoll();
    else if (g_usb_mode == USB_LOGGING) usbLoggingPoll();
#if defined(ENABLE_KELLY)
    else if (g_usb_mode == USB_KELLY) {
        while (Serial.available()) kelly.write(Serial.read());
        while (kelly.available())  Serial.write(kelly.read());
    }
#endif

#if !defined(NO_WIFI)
    socketcandPoll();
    dns_server.processNextRequest();
    server.handleClient();
#endif
#if !defined(NO_BLE)
    bleTick();
#endif
    updateLed();
#if defined(HAS_VIN_SENSE)
    updateVinSense();
#endif
#if defined(ENABLE_KELLY)
    // Suspend the regular Kelly monitor queries only while the USB is bridged to
    // the Kelly, so the firmware isn't a second master on that single-master bus.
    if (g_usb_mode != USB_KELLY)
        kellyPoll();
#endif
#if defined(AUTOSHUTDOWN)
    checkCanQuietSleep();
#endif
}
